#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Part 1
The numbers are coordinates on an infinite grid. The posiiton
corresponds to a "code" needed to run Santa's weather machine. The
coordinates correspond to a value to raise a number by. Here's the
formula:

$f(n) = 20151125 \cdot 252533^n (mod 33554393)$

n can be calculated from the x/y pair as follows:

$n(x,y) = \frac{(x + y - 1) \cdot (x + y - 2)}{2} + y$

#+NAME: diagonal
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun diagonal (x y)
    (+ (/ (* (+ x y -1)
             (+ x y -2))
          2)
       y))
#+END_SRC

#+BEGIN_SRC lisp
  (diagonal 3010 3019)
#+END_SRC

#+RESULTS:
: 18168397

#+NAME: code
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun code (x y)
    (mod (* 20151125
            (mod-expt 252533 (1- (diagonal x y)) 33554393))
         33554393))
#+END_SRC

As I suspected, the exponentiation is slow (it's generating big
integers and will only mod them at the end).

#+NAME: mod-expt
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun mod-expt (a n m)
    (iter (with c = 1)
          (while (plusp n))
          (if (oddp n) (setf c (mod (* a c) m)))
          (setf n (floor n 2))
          (setf a (mod (* a a) m))
          (finally (return c))))
#+END_SRC

#+NAME: problem-a
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun problem-a () (format t "Problem 25 A: ~a~%" (apply #'code *input*)))
#+END_SRC
